{
  "posts": [
    {
      "id": "1732782327290",
      "title": "All Javascript Concepts ( A-Z) Basic to Advanced",
      "category": "Programming",
      "description": "In this post, I’ve covered key JavaScript concepts ranging from basic topics like variables and data types, to more advanced concepts such as closures, promises, asynchronous programming, object-oriented programming, event handling, and ES6+ features like arrow functions, destructuring, and modules.",
      "thumbnail": "https://media.daily.dev/image/upload/s--no2yCEHF--/f_auto/v1731865715/posts/HBJQLUdFi",
      "userId": 1,
      "created_at": "2024-11-28T08:25:27.290Z"
    },
    {
      "id": "1732785044411",
      "title": "What’s New in React 18: Must-Know Features & Upgrades for Beginners",
      "category": "Programming",
      "description": "TLDRReact 18 introduces several impactful features aimed at improving concurrency, performance, and the overall developer experience. Key highlights include concurrent rendering for smoother UIs, automatic batching to reduce unnecessary renders, the useTransition hook to prioritize updates, and enhanced Suspense for simpler",
      "thumbnail": "https://media.daily.dev/image/upload/f_auto,q_auto/v1/posts/129df34569b6ff49d19d7c68c1021e02?_a=AQAEuiZ",
      "userId": 1,
      "created_at": "2024-11-28T09:10:44.411Z"
    },
    {
      "id": "1732793068521",
      "title": "Teams Toolkit for Visual Studio Code update – November 2024",
      "category": "Programming",
      "description": "TLDRThe latest Teams Toolkit for Visual Studio Code update, version 5.10.1, introduces several new features, enhancements, and crucial bug fixes. Notable updates include terminology changes, stability improvements for debug sessions, and schema validation fixes.",
      "thumbnail": "https://media.daily.dev/image/upload/f_auto,q_auto/v1/posts/e2a12d25a6396f1a931ba1805f6b2927?_a=AQAEuj9",
      "userId": 1,
      "created_at": "2024-11-28T11:24:28.521Z"
    },
    {
      "id": "1732793317002",
      "title": "How to use ORMs (Prisma / Drizzle / Knex.js) in a TypeScript backend built with Encore.ts",
      "category": "Programming",
      "description": "Learn how to use ORMs such as Prisma, Drizzle, and Knex.js with Encore.ts in a TypeScript backend. The guide covers creating and managing databases locally, deploying apps to the cloud, and using SQL and ORM approaches for database interactions. Example configurations and code snippets for each ORM are provided along with deployment instructions for Docker and cloud platforms.",
      "thumbnail": "https://media2.dev.to/dynamic/image/width=1000,height=420,fit=cover,gravity=auto,format=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2F2x9103e05f6j4f5cqj5g.png",
      "userId": 1,
      "created_at": "2024-11-28T11:28:37.002Z"
    }
  ]
}