{
  "posts": [
    {
      "id": "1732782327290",
      "title": "All Javascript Concepts ( A-Z) Basic to Advanced",
      "category": "Programming",
      "description": "In this post, I’ve covered key JavaScript concepts ranging from basic topics like variables and data types, to more advanced concepts such as closures, promises, asynchronous programming, object-oriented programming, event handling, and ES6+ features like arrow functions, destructuring, and modules.",
      "thumbnail": "https://media.daily.dev/image/upload/s--no2yCEHF--/f_auto/v1731865715/posts/HBJQLUdFi",
      "userId": 1,
      "created_at": "2024-11-28T08:25:27.290Z"
    },
    {
      "id": "1732785044411",
      "title": "What’s New in React 18: Must-Know Features & Upgrades for Beginners",
      "category": "Programming",
      "description": "TLDRReact 18 introduces several impactful features aimed at improving concurrency, performance, and the overall developer experience. Key highlights include concurrent rendering for smoother UIs, automatic batching to reduce unnecessary renders, the useTransition hook to prioritize updates, and enhanced Suspense for simpler",
      "thumbnail": "https://media.daily.dev/image/upload/f_auto,q_auto/v1/posts/129df34569b6ff49d19d7c68c1021e02?_a=AQAEuiZ",
      "userId": 1,
      "created_at": "2024-11-28T09:10:44.411Z"
    },
    {
      "id": "1732793068521",
      "title": "Teams Toolkit for Visual Studio Code update – November 2024",
      "category": "Programming",
      "description": "TLDRThe latest Teams Toolkit for Visual Studio Code update, version 5.10.1, introduces several new features, enhancements, and crucial bug fixes. Notable updates include terminology changes, stability improvements for debug sessions, and schema validation fixes.",
      "thumbnail": "https://media.daily.dev/image/upload/f_auto,q_auto/v1/posts/e2a12d25a6396f1a931ba1805f6b2927?_a=AQAEuj9",
      "userId": 1,
      "created_at": "2024-11-28T11:24:28.521Z"
    },
    {
      "id": "1732793317002",
      "title": "How to use ORMs (Prisma / Drizzle / Knex.js) in a TypeScript backend built with Encore.ts",
      "category": "Programming",
      "description": "Learn how to use ORMs such as Prisma, Drizzle, and Knex.js with Encore.ts in a TypeScript backend. The guide covers creating and managing databases locally, deploying apps to the cloud, and using SQL and ORM approaches for database interactions. Example configurations and code snippets for each ORM are provided along with deployment instructions for Docker and cloud platforms.",
      "thumbnail": "https://media2.dev.to/dynamic/image/width=1000,height=420,fit=cover,gravity=auto,format=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2F2x9103e05f6j4f5cqj5g.png",
      "userId": 1,
      "created_at": "2024-11-28T11:28:37.002Z"
    },
    {
      "id": "1733042017553",
      "title": "LibreChat vs Open WebUI: Choose the Right ChatGPT UI for Your Organization",
      "category": "Gaming",
      "description": "LibreChat and Open WebUI are two open-source platforms that facilitate building secure, in-house AI systems. LibreChat is known for its enterprise-level authentication and flexibility, while Open WebUI offers streamlined user management and a variety of integrations. Both platforms, when integrated with Portkey, provide enhanced security, observability, and reliability for AI operations. ",
      "thumbnail": "https://media.daily.dev/image/upload/f_auto,q_auto/v1/posts/961e99667864712859d2b236767caf05?_a=AQAEuj9",
      "userId": 1,
      "created_at": "2024-12-01T08:33:37.553Z"
    },
    {
      "id": "1733042065306",
      "title": "A Million Times Faster: Million.js vs React",
      "category": "Programming",
      "description": "Modern web development emphasizes performance, making the choice of a front-end library crucial. React, a mature tool with a component-based architecture, is often used for building dynamic interfaces but can be slower due to its size. Million.js, a newer library by Aiden Bai, focuses on highly optimized rendering, reducing overhead, and using performant algorithms, making it ideal for performance-sensitive applications. ",
      "thumbnail": "https://media.daily.dev/image/upload/f_auto,q_auto/v1/posts/847e431f5cea5655b08e01a35ff47605?_a=AQAEuiZ",
      "userId": 1,
      "created_at": "2024-12-01T08:34:25.306Z"
    },
    {
      "id": "1733069599207",
      "title": "Efficient Dynamic Forms with ngComponentOutlet in Angular",
      "category": "Technology",
      "description": "Angular's ngComponentOutlet simplifies dynamic component loading, allowing developers to create flexible and reusable components. With the new input binding introduced in Angular 17, developers can now handle dynamic nested forms more efficiently without manually declaring injectors. Key benefits include faster development cycles, reduced bundle sizes, improved performance, scalability, and easier maintenance. ",
      "thumbnail": "https://media.daily.dev/image/upload/f_auto,q_auto/v1/posts/b57530449daa2377dba81e56a9538bb7?_a=AQAEuiZ",
      "userId": 1,
      "created_at": "2024-12-01T16:13:19.207Z"
    },
    {
      "id": 1733138203971,
      "title": "Ng-News 24/45: Rationale behind (potential) Authoring Format",
      "category": "Technology",
      "description": "The Angular team is exploring new authoring formats due to the time-consuming adaptation of TypeScript functionality in templates, which is not true TypeScript. At ng-Poland, this reasoning was clarified. The team also shared updates on introducing Signals into various parts of Angular, such as forms and the router.",
      "thumbnail": "https://media.daily.dev/image/upload/f_auto,q_auto/v1/posts/4ba3f7b0878b9c3f92b0240405c26c8a?_a=AQAEuj9",
      "userId": 1,
      "created_at": "2024-12-02T11:16:43.971Z"
    }
  ]
}